MOVE REPORT-HEADER-2 TO PIZZA-OUTPUT-REC
           MOVE ITEM-HEADER     TO PIZZA-OUTPUT-REC
           MOVE ID-LINE         TO PIZZA-OUTPUT-REC
           MOVE DETAIL-LINE     TO PIZZA-OUTPUT-REC